Repository: fighter-99/ImageGalleryXcode
Catalog: ImageGallery/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

# settingsFontSizeSubtitle
source: 调整 app 内所有文字大小。macOS 没系统级 Dynamic Type 设置, 这是 in-app 入口。
en: Adjust all in-app text size. macOS has no system-wide Dynamic Type setting — this is the in-app entry.
zh_hant: 調整 app 內所有文字大小。macOS 沒系統級 Dynamic Type 設定, 這是 in-app 入口。

# settingsFontSizeTitle
source: 字体大小
en: Font Size
zh_hant: 字型大小

# settingsFormatLabel
source: 格式
en: Format

# settingsHelpDocs
source: 使用帮助
en: User Guide
zh_hant: 使用說明

# settingsHelpLabel
source: 帮助
en: Help
zh_hant: 說明

# settingsHelpTooltip
source: 使用帮助
en: User Guide
zh_hant: 使用說明

# settingsImportLocationChooseButton
source: 选择...
en: Choose...
zh_hant: 選擇...

# settingsImportLocationClearButton
source: 清除
en: Clear

# settingsImportLocationEmpty
source: 未设置
en: Not Set
zh_hant: 未設定

# settingsImportLocationLabel
source: 文件夹
en: Folder
zh_hant: 資料夾

# settingsImportLocationSubtitle
source: 设置后, ⌘O 自动打开这个文件夹。留空则每次手动选择。
en: When set, ⌘O automatically opens this folder. Leave empty to choose each time.
zh_hant: 設定後, ⌘O 自動開啟這個資料夾。留空則每次手動選擇。

# settingsImportLocationTitle
source: 默认导入位置
en: Default Import Location
zh_hant: 預設匯入位置

# settingsImportSubtitle
source: 拖入或选择文件夹导入图片时的默认行为。
en: Default behavior when dragging in or selecting a folder to import photos.
zh_hant: 拖入或選擇資料夾匯入圖片時的預設行為。

# settingsImportTitle
source: 导入
en: Import
zh_hant: 匯入

# settingsIssueTracker
source: 问题反馈
en: Report an Issue
zh_hant: 問題回報

# settingsLanguageSubtitle
source: App 显示语言。需重启 app 让部分 SwiftUI 文案刷新。
en: App display language. Restart required for some SwiftUI text to refresh.
zh_hant: App 顯示語言。需重啟 app 讓部分 SwiftUI 文案刷新。

# settingsLanguageTitle
source: 语言 / Language
en: Language / “语言”
zh_hant: 語言 / Language

# settingsLayoutLabel
source: 布局
en: Layout
zh_hant: 佈局

# settingsLayoutSubtitle
source: 缩略图的显示形状。方格按比例裁切, 按比例保留原图比例。
en: Thumbnail display shape. Square crops to fit, Aspect preserves original ratio.
zh_hant: 縮圖的顯示形狀。方格按比例裁切, 按比例保留原圖比例。

# settingsLayoutTitle
source: 缩略图布局
en: Thumbnail Layout
zh_hant: 縮圖佈局

# settingsLinksTitle
source: 链接
en: Links
zh_hant: 連結

# settingsMenu
source: 设置…
en: Settings…
zh_hant: 設定…

# settingsOpenDataFolderButton
source: 在 Finder 中显示
en: Show in Finder
zh_hant: 在 Finder 中顯示

# settingsOpenDataFolderLabel
source: 数据文件夹
en: Data Folder
zh_hant: 資料資料夾

# settingsOpenDataFolderTooltip
source: 在 Finder 中显示 App 数据存储目录 (Application Support/ImageGallery)
en: Show app data storage directory in Finder (Application Support/ImageGallery)
zh_hant: 在 Finder 中顯示 App 資料儲存目錄 (Application Support/ImageGallery)

# settingsProjectHomepage
source: 项目主页
en: Project Homepage
zh_hant: 專案首頁

# settingsQualityLabel
source: 质量
en: Quality
zh_hant: 品質

# settingsResetAll
source: 恢复全部为默认
en: Reset all to defaults
zh_hant: 恢復全部為預設

# settingsResetAllLabel
source: 所有偏好设置
en: All Preferences
zh_hant: 所有偏好設定

# settingsResetAllTooltip
source: 恢复全部设置为默认
en: Reset all settings to defaults
zh_hant: 恢復全部設定為預設

# settingsResetConfirmAction
source: 恢复默认
en: Reset to Defaults
zh_hant: 恢復預設

# settingsResetConfirmMessage
source: 这将清空你所有的偏好设置（默认排序、视图模式、缩略图大小、外观模式等）。
en: This will clear all your preferences (default sort, view mode, thumbnail size, appearance, etc.).
zh_hant: 這將清空你所有的偏好設定（預設排序、檢視模式、縮圖大小、外觀模式等）。

# settingsResetConfirmTitle
source: 恢复全部为默认？
en: Reset All to Defaults?
zh_hant: 恢復全部為預設？

# settingsRetentionLabel
source: 保留时长
en: Retention
zh_hant: 保留時長

# settingsRetentionSubtitle
source: 删除的照片在回收站中保留的天数。超过后自动永久删除。
en: Number of days deleted photos stay in trash. After that, they are permanently deleted.
zh_hant: 刪除的照片在垃圾桶中保留的天數。超過後自動永久刪除。

# settingsRetentionTitle
source: 保留时长
en: Retention Duration
zh_hant: 保留時長

# settingsShortcutsLabel
source: 完整快捷键列表
en: Full Keyboard Shortcuts List
zh_hant: 完整快捷鍵列表

# settingsShortcutsShowButton
source: 打开速查
en: Open Cheat Sheet
zh_hant: 開啟速查

# settingsShortcutsSubtitle
source: 查看 app 内所有快捷键。也可以按 ⌘? 随时打开速查。
en: View all in-app shortcuts. You can also press ⌘? to open the cheat sheet anytime.
zh_hant: 查看 app 內所有快捷鍵。也可以按 ⌘? 隨時開啟速查。

# settingsShortcutsTitle
source: 快捷键
en: Shortcuts
zh_hant: 快捷鍵

# settingsSizeLabel
source: 大小
en: Size

# settingsSortLabel
source: 排序
en: Sort

# settingsThumbnailSizeHelpTooltip
source: 实时预览缩略图大小
en: Live preview of thumbnail size
zh_hant: 即時預覽縮圖大小

# settingsThumbnailSizeLarge
source: 大
en: Large

# settingsThumbnailSizeSmall
source: 小
en: Small

# settingsThumbnailSizeSubtitle
source: 默认缩略图尺寸。拖动 slider 实时预览缩略图大小。当前会话用 toolbar 临时改的会在重启后恢复。
en: Default thumbnail size. Drag the slider to preview. Toolbar changes for current session reset on relaunch.
zh_hant: 預設縮圖尺寸。拖動 slider 即時預覽縮圖大小。目前工作階段用工具列臨時改的會在重啟後恢復。

# settingsThumbnailSizeTitle
source: 缩略图大小
en: Thumbnail Size
zh_hant: 縮圖大小

# settingsTitle
source: 设置
en: Settings
zh_hant: 設定

# settingsViewModeLabel
source: 视图
en: View
zh_hant: 檢視

# shortcutsCopyToPasteboard
source: 复制到剪贴板
en: Copy to Clipboard
zh_hant: 複製到剪貼簿

# shortcutsExportSelected
source: 导出选中
en: Export Selected
zh_hant: 匯出選中

# shortcutsFocusSearch
source: 聚焦搜索框
en: Focus Search
zh_hant: 聚焦搜尋框

# shortcutsImmersive
source: 进入沉浸式
en: Enter Immersive
zh_hant: 進入沉浸式

# shortcutsImportImage
source: 导入图片
en: Import Photo
zh_hant: 匯入圖片

# shortcutsNewFolder
source: 新建文件夹
en: New Folder
zh_hant: 新建資料夾

# shortcutsNextPhoto
source: 下一张
en: Next
zh_hant: 下一張

# shortcutsOpenSettings
source: 设置
en: Settings
zh_hant: 設定

# shortcutsPrevPhoto
source: 上一张
en: Previous
zh_hant: 上一張

# shortcutsQuickLook
source: 快速查看
en: Quick Look

# shortcutsRedo
source: 重做
en: Redo

# shortcutsResetFilter
source: 重置筛选
en: Reset Filter
zh_hant: 重設篩選

# shortcutsResetZoom
source: 重置缩略图大小
en: Reset Thumbnail Size
zh_hant: 重設縮圖大小

# shortcutsSectionEdit
source: 编辑
en: Edit
zh_hant: 編輯

# shortcutsSectionFile
source: 文件
en: File
zh_hant: 檔案

# shortcutsSectionNavigation
source: 导航 / 缩放
en: Navigation / Zoom
zh_hant: 導航 / 縮放

# shortcutsSectionSidebar
source: 侧栏 / 详情
en: Sidebar / Detail
zh_hant: 側邊欄 / 詳細資訊

# shortcutsSectionSortFilter
source: 排序 / 筛选
en: Sort / Filter
zh_hant: 排序 / 篩選

# shortcutsSectionView
source: 视图
en: View
zh_hant: 視圖

# shortcutsToggleDetail
source: 切换详情面板
en: Toggle Detail Pane
zh_hant: 切換詳細資訊面板

# shortcutsToggleInfo
source: 切换信息面板
en: Toggle Info Pane
zh_hant: 切換資訊面板

# shortcutsToggleSidebar
source: 切换侧栏
en: Toggle Sidebar
zh_hant: 切換側邊欄

# shortcutsToggleSort
source: 切换排序方向
en: Toggle Sort Order
zh_hant: 切換排序方向

# shortcutsUndo
source: 撤销
en: Undo
zh_hant: 復原

# shortcutsViewGrid
source: 网格视图
en: Grid View
zh_hant: 網格視圖

# shortcutsViewList
source: 列表视图
en: List View
zh_hant: 列表視圖

# shortcutsViewTimeline
source: 时间线视图
en: Timeline View
zh_hant: 時間軸視圖

# shortcutsZoomIn
source: 放大缩略图
en: Zoom In
zh_hant: 放大縮圖

# shortcutsZoomOut
source: 缩小缩略图
en: Zoom Out
zh_hant: 縮小縮圖

# showDetailPanel
source: 显示详情面板
en: Show Detail Panel
zh_hant: 顯示详情麵板

# showInfoPanel
source: 显示信息面板
en: Show Info Panel
zh_hant: 顯示資訊麵板

# showSidebar
source: 显示侧边栏
en: Show Sidebar
zh_hant: 顯示側邊欄

# sidebarAll
source: 全部
en: All

# sidebarCollapse
source: 折叠
en: Collapse
zh_hant: 收合

# sidebarDeleteSmartFolder
source: 删除智能文件夹
en: Delete Smart Folder
zh_hant: 刪除智慧型資料夾

# sidebarDuplicates
source: 重复图
en: Duplicates
zh_hant: 重複圖

# sidebarExpand
source: 展开
en: Expand
zh_hant: 展開

# sidebarLargeFiles
source: 大图（>5MB）
en: Large Files (>5MB)
zh_hant: 大圖（>5MB）

# sidebarNewSmartFolder
source: 新建智能文件夹
en: New Smart Folder
zh_hant: 新增智慧型資料夾

# sidebarRecent7Days
source: 最近 7 天
en: Recent 7 Days

# sidebarRecentlyDeleted
source: 回收站
en: Trash
zh_hant: 垃圾桶

# sidebarRowShowLabel
source: 显示 %@
en: Show %@
zh_hant: 顯示 %@

# sidebarSectionFolders
source: 我的文件夹
en: My Folders
zh_hant: 我的資料夾

# sidebarSectionLibrary
source: 我的图馆
en: My Library
zh_hant: 我的圖館

# sidebarSectionRecycleBin
source: 最近删除
en: Recently Deleted
zh_hant: 最近刪除

# sidebarSectionSmartFolders
source: 智能文件夹
en: Smart Folders
zh_hant: 智慧型資料夾

# sidebarSectionTags
source: 标签
en: Tags
zh_hant: 標籤

# sidebarUnfiled
source: 待整理
en: Unfiled

# skipAll
source: 全部跳过（保留现有）
en: Skip All (keep existing)
zh_hant: 全部跳過（保留现有）

# smartFolderDuplicateSuffix
source: 副本
en: Copy

# smartFolderEditTitle
source: 编辑智能文件夹
en: Edit Smart Folder
zh_hant: 編輯智慧型資料夾

# smartFolderEmptyFilterHint
source: 当前工具栏无筛选条件 (智能文件夹将匹配全部图库照片)
en: No toolbar filter conditions (smart folder will match all library photos)
zh_hant: 目前工具列無篩選條件 (智慧型資料夾將比對全部圖庫照片)

# smartFolderFallback
source: 智能文件夹
en: Smart Folder
zh_hant: 智慧型資料夾

# smartFolderFilterSection
source: 筛选条件
en: Filter Conditions
zh_hant: 篩選條件

# smartFolderFolderCount
source: %lld 文件夹
en: %lld folders
zh_hant: %lld 資料夾

# smartFolderIconBookmark
source: 书签
en: Bookmark
zh_hant: 書籤

# smartFolderIconFlame
source: 热门
en: Hot
zh_hant: 熱門

# smartFolderIconFolder
source: 文件夹
en: Folder
zh_hant: 資料夾

# smartFolderIconHeart
source: 喜欢
en: Liked
zh_hant: 喜歡

# smartFolderIconHeartCircle
source: 收藏
en: Favorites

# smartFolderIconLeaf
source: 自然
en: Nature

# smartFolderIconMoon
source: 夜景
en: Night

# smartFolderIconPhotoStack
source: 相册
en: Album
zh_hant: 相簿

# smartFolderIconSection
source: 图标
en: Icon
zh_hant: 圖示

# smartFolderIconSparkle
source: 精选集
en: Highlights
zh_hant: 精選集

# smartFolderIconStar
source: 星标
en: Starred
zh_hant: 星號

# smartFolderIconStarCircle
source: 精选
en: Featured
zh_hant: 精選

# smartFolderIconSun
source: 明亮
en: Bright

# smartFolderIconTag
source: 标签
en: Tag
zh_hant: 標籤

# smartFolderMinRating
source: ≥%lld 星
en: ≥%lld stars

# smartFolderNamePlaceholder
source: 智能文件夹名
en: Smart folder name
zh_hant: 智慧型資料夾名稱

# smartFolderShapeCount
source: %lld 形状
en: %lld shapes
zh_hant: %lld 形狀

# smartFolderSheetTitle
source: 新建智能文件夹
en: New Smart Folder
zh_hant: 新增智慧型資料夾

# smartFolderTagCount
source: %lld 标签
en: %lld tags
zh_hant: %lld 標籤

# sort
source: 排序
en: Sort

# sortCategoryCustom
source: 自定义
en: Custom
zh_hant: 自定義

# sortCategoryFilename
source: 文件名
en: Filename
zh_hant: 檔案名

# sortCategoryFileSize
source: 文件大小
en: File Size
zh_hant: 檔案大小

# sortCategoryImportTime
source: 导入时间
en: Import Time
zh_hant: 匯入時間

# sortCustomOrder
source: 自定义顺序
en: Custom Order
zh_hant: 自定義顺序

# sortFilenameAsc
source: 文件名 A → Z
en: Filename A → Z
zh_hant: 檔案名 A → Z

# sortFilenameDesc
source: 文件名 Z → A
en: Filename Z → A
zh_hant: 檔案名 Z → A

# sortFileSizeAsc
source: 文件大小 ↑
en: File Size ↑
zh_hant: 檔案大小 ↑

# sortFileSizeDesc
source: 文件大小 ↓
en: File Size ↓
zh_hant: 檔案大小 ↓

# sortImportedAsc
source: 导入时间 ↑
en: Import Time ↑
zh_hant: 匯入時間 ↑

# sortImportedDesc
source: 导入时间 ↓
en: Import Time ↓
zh_hant: 匯入時間 ↓

# speakMultiplePhotos
source: 已选 %lld 张照片，第一张 %@
en: Selected %lld photos, first %@
zh_hant: 已選 %lld 張照片，第一張 %@

# speakOnePhoto
source: 已选 1 张照片，文件名 %@
en: Selected 1 photo, filename %@
zh_hant: 已選 1 張照片，檔名 %@

# statusCountAndSize
source: %lld 张 · %@
en: %lld photos · %@
zh_hant: %lld 張 · %@

# statusFilteredSuffix
source: · 已筛选 (%lld)
en: · Filtered (%lld)
zh_hant: · 已篩選 (%lld)

# storageError
source: 无法保存图片到图库。请检查磁盘空间，或在「系统设置 → 隐私与安全 → 完整磁盘访问权限」中授权 ImageGallery，然后重试。
en: Cannot save photos to library. Check disk space or grant Full Disk Access in System Settings → Privacy & Security → Full Disk Access to ImageGallery, then retry.
zh_hant: 無法儲存圖片到圖庫。請检查磁盤空間，或在「系統設定 → 隐私與安全 → 完整磁盤访問權限」中授權 ImageGallery，然後重試。

# storageRetry
source: 重试
en: Retry
zh_hant: 重試

# storageUnavailableTitle
source: 存储不可用
en: Storage Unavailable
zh_hant: 存儲不可用

# tagLabel
source: 标签
en: Tags
zh_hant: 標籤

# tagNamePlaceholder
source: 标签名称
en: Tag name
zh_hant: 標籤名称

# termCountUnit
source: 张
en: photos
zh_hant: 張

# termDayUnit
source: 天
en: days

# termLibrary
source: 图库
en: Library
zh_hant: 圖庫

# termPhoto
source: 图片
en: Photo
zh_hant: 圖片

# termRecycleBin
source: 回收站
en: Trash
zh_hant: 垃圾桶

# thumbnailAccessibilityHint
source: 单击切换选中, 双击进入沉浸式查看, 右键显示更多操作
en: Single-click to select, double-click for immersive view, right-click for more actions
zh_hant: 按一下切換選中, 雙擊進入沉浸式檢視, 右鍵顯示更多操作

# thumbnailDensityCompact
source: 极小
en: Extra Small
zh_hant: 極小

# thumbnailDensityLarge
source: 大
en: Large

# thumbnailDensityMedium
source: 中
en: Medium

# thumbnailDensitySmall
source: 小
en: Small

# thumbnailDragCount
source: 共 %lld 张
en: %lld photos
zh_hant: 共 %lld 張

# thumbnailLoadFailed
source: 加载失败
en: Load failed
zh_hant: 載入失敗

# thumbnailSize
source: 缩略图大小
en: Thumbnail Size
zh_hant: 縮圖大小

# thumbnailSizeCompact
source: 特小 70pt
en: Tiny 70pt

# thumbnailSizeLarge
source: 大 250pt
en: Large 250pt

# thumbnailSizeMedium
source: 中 200pt
en: Medium 200pt

# thumbnailSizeSmall
source: 小 110pt
en: Small 110pt

# titlebarInfoLabel
source: 信息面板
en: Info Panel
zh_hant: 資訊面板

# titlebarInfoTooltipHide
source: 隐藏信息面板 (⌘I)
en: Hide Info Panel (⌘I)
zh_hant: 隱藏資訊面板 (⌘I)

# titlebarInfoTooltipShow
source: 显示信息面板 (⌘I)
en: Show Info Panel (⌘I)
zh_hant: 顯示資訊面板 (⌘I)

# toastBatchMoveFetchFailed
source: 移动照片失败：%@
en: Failed to move photos: %@
zh_hant: 移動照片失敗：%@

# toastBatchRenameCollisions
source: %lld 张照片重命名跳过（已有 _1.._9999 同名文件）
en: %lld photos renamed skipped (already have _1.._9999 same-name files)
zh_hant: %lld 張照片重新命名跳過（已有 _1.._9999 同名檔案）

# toastBatchRenamePartialFail
source: 部分重命名失败:%lld 张
en: Some renames failed: %lld
zh_hant: 部分重新命名失敗:%lld 張

# toastBatchRenameSuccess
source: 已重命名 %lld 张照片
en: Renamed %lld photos
zh_hant: 已重新命名 %lld 張照片

# toastBatchRenameUndoPartialFail
source: 部分撤销失败:%lld 张
en: Some undos failed: %lld
zh_hant: 部分復原失敗:%lld 張

# toastCloseHelp
source: 关闭
en: Close
zh_hant: 關閉

# toastCropped
source: 已裁剪 %lld 张图片
en: Cropped %lld images
zh_hant: 已裁剪 %lld 張圖片

# toastMovedToRecycleBinCount
source: 已移到回收站 %lld 张
en: Moved %lld photos to Recycle Bin
zh_hant: 已移到垃圾桶 %lld 張

# toastRestored
source: 已恢复 %lld 张图片
en: Restored %lld photos
zh_hant: 已還原 %lld 張圖片

# toastRotated
source: 已旋转 %lld 张图片
en: Rotated %lld photos
zh_hant: 已旋轉 %lld 張圖片

# toastSelectCropFirst
source: 请先选择要裁剪的图片
en: Please select photos to crop first
zh_hant: 請先選擇要裁剪的圖片

# toastSelectRotateFirst
source: 请先选择要旋转的图片
en: Select photos to rotate first
zh_hant: 請先選擇要旋轉的圖片

# toastSelectShareFirst
source: 请先选择要分享的图片
en: Select photos to share first
zh_hant: 請先選擇要分享的圖片

# toastSelectSpeakFirst
source: 请先选择要朗读的图片
en: Select photos to speak first
zh_hant: 請先選擇要朗讀的圖片

# toastUndoCrop
source: 已撤销裁剪 %lld 张
en: Undone crop %lld photos
zh_hant: 已復原裁剪 %lld 張

# toastUndoHelp
source: 撤销 (⌘Z)
en: Undo (⌘Z)
zh_hant: 復原 (⌘Z)

# toastUndoRotate
source: 已撤销旋转 %lld 张
en: Undid rotation of %lld photos
zh_hant: 已復原旋轉 %lld 張

# toolbarExport
source: 导出
en: Export
zh_hant: 匯出

# toolbarImport
source: 导入
en: Import
zh_hant: 匯入

# toolbarToggleSidebar
source: 切换侧边栏
en: Toggle Sidebar
zh_hant: 切換側邊欄

# totalCount
source: %lld 张
en: %lld photos
zh_hant: %lld 張

# trashRetentionDays
source: %lld 天
en: %lld days

# undo
source: 撤销
en: Undo
zh_hant: 復原

# undoAddTag
source: 添加标签 %@
en: Add tag %@
zh_hant: 添加標籤 %@

# undoBatchRename
source: 批量重命名 %lld 张照片
en: Batch rename %lld photos
zh_hant: 批次重新命名 %lld 張照片

# undoCrop
source: 裁剪 %lld 张照片
en: Crop %lld photos
zh_hant: 裁剪 %lld 張照片

# undoDeleteMany
source: 删除 %lld 张照片
en: Delete %lld photos
zh_hant: 刪除 %lld 張照片

# undoDeleteOne
source: 删除 1 张照片
en: Delete 1 photo
zh_hant: 刪除 1 張照片

# undoMarkup
source: 标注 %lld 张照片
en: Markup %lld photos
zh_hant: 標註 %lld 張照片

# undoMoveToFolder
source: 移动 %lld 张照片到 %@
en: Move %lld photos to %@
zh_hant: 移動 %lld 張照片到 %@

# undoRate
source: 评分 %lld 星
en: Rate %lld stars
zh_hant: 評分 %lld 星

# undoRemoveTag
source: 移除标签 %@
en: Remove tag %@
zh_hant: 移除標籤 %@

# undoRename
source: 重命名为 %@
en: Rename to %@
zh_hant: 重新命名為 %@

# undoRotate
source: 旋转 %lld 张照片
en: Rotate %lld photos
zh_hant: 旋轉 %lld 張照片

# undoWithAction
source: 撤销 %@
en: Undo %@
zh_hant: 復原 %@

# unknownFolder
source: 未知文件夹
en: Unknown Folder
zh_hant: 未知資料夾

# unknownTag
source: 未知标签
en: Unknown Tag
zh_hant: 未知標籤

# viewAll
source: 查看全部
en: View All

# viewModeGrid
source: 网格
en: Grid
zh_hant: 網格

# viewModeGridFull
source: 缩略图视图
en: Thumbnail View
zh_hant: 縮圖視圖

# viewModeList
source: 列表
en: List

# viewModeListFull
source: 列表视图
en: List View
zh_hant: 列表視圖

# viewModeTimeline
source: 时间线
en: Timeline
zh_hant: 時間線

# viewModeTimelineFull
source: 时间线视图
en: Timeline View
zh_hant: 時間線視圖

# zoomIn
source: 放大
en: Zoom In

# zoomOut
source: 缩小
en: Zoom Out
zh_hant: 縮小
